{
  "jig{": {
    "EntryType": "inproceedings",
    "author": "Blank, Douglas and Kay, Jennifer S and Marshall, James B and O'Hara, Keith and Russo, Mark",
    "booktitle": "Proceedings of the 43rd ACM technical symposium on Computer Science Education",
    "organization": "ACM",
    "pages": "63--68",
    "title": "{Calico: A multi-programming-language, multi-context framework designed for computer science education",
    "year": "2012"
  },
  "reali1{": {
    "EntryType": "book",
    "abstract": "En un entorno virtual de aprendizaje, el retorno(feedback) por parte del profesor de las actividades deevaluaci{\\'{o",
    "author": "Ba{\\~{n",
    "booktitle": "Jornadas de Ense{\\~{n",
    "isbn": "9788469580516",
    "keywords": "Competencias,Computer science,Docencia virtual,Ensenyament,Evaluaci{\\'{o",
    "month": "jul",
    "publisher": "Universitat Jaume I. Escola Superior de Tecnologia i Ci{\\`{e",
    "title": "{An{\\'{a",
    "url": "https://upcommons.upc.edu/handle/2099/15121",
    "year": "2013"
  },
  "NikolaosPellas2014{": {
    "EntryType": "article",
    "author": "{Nikolaos Pellas",
    "issn": "1826-6223",
    "journal": "Journal of e-Learning and Knowledge Society",
    "keywords": "concurrent programming $\\backslash$nScratch4OS $\\backslash$nOpen Sim$\\backslash$nSe",
    "number": "1",
    "pages": "129--143",
    "publisher": "Italian e-Learning Association",
    "title": "{The development of a virtual learning platform for teaching concurrent programming languages in Secondary education: The use of Open Sim and Scratch4OS",
    "url": "http://www.je-lks.org/ojs/index.php/Je-LKS{\\_",
    "volume": "10",
    "year": "2014"
  },
  "Rico2011{": {
    "EntryType": "article",
    "abstract": "Virtual Worlds have become a very popular kind of software application that has been used in different fields, from games to simulation or education. They allow individuals to interact with others through their avatars and with objects in the environment. Virtual Worlds ...",
    "author": "Rico, M. and Mart{\\'{i",
    "issn": "0949-149X",
    "journal": "International Journal of Engineering Education",
    "number": "1",
    "pages": "52",
    "title": "{A programming experience of high school students in a virtual world platform",
    "url": "http://aida.ii.uam.es:8080/vleaf/es/manuales/VLEAF{\\_",
    "volume": "27",
    "year": "2011"
  },
  "Rummel2008{": {
    "EntryType": "inproceedings",
    "abstract": "Scaffolding learners, i.e. helping learners to attain tasks they could not accomplish without support, entails the notion of fading, i.e. reducing the scaffolding for learners to become more and more self-regulated. Fading implies to tailor support for collaboration, such as collaboration scripts, to the particular needs of the specific collaborators. In computer supported collaborative learning (CSCL) settings, support can be designed in a very restrictive and inflexible fashion; at the same time computerized settings open new possibilities for the realization of adaptive support as they enable automation of analysis and feedback mechanisms. In this symposium we present new technical approaches and latest empirical research on possibilities and limitations of adaptive support for learners in CSCL settings.",
    "author": "Rummel, Nikol and Weinberger, Armin and Wecker, Christof and Fischer, Frank and Meier, Anne and Voyiatzaki, Eleni and Kahrimanis, George and Spada, Hans and Avouris, Nikolaos and Walker, Erin and Koedinger, Kenneth and Ros{\\'{e",
    "booktitle": "ICLS'08: Proceedings of the 8th international conference on International conference for the learning sciences",
    "keywords": "cscl,scaffolding,scripts",
    "pages": "338--345",
    "publisher": "International Society of the Learning Sciences",
    "title": "{New challenges in CSCL: towards adaptive script support",
    "url": "http://portal.acm.org/citation.cfm?id=1599936.1600036",
    "year": "2008"
  },
  "Esteves2010{": {
    "EntryType": "article",
    "abstract": "The emergence of new technologies such as three-dimensional virtual worlds brings new opportunities for teaching and learning. We conducted an action research approach to the analysis of how teaching and learning of computer programming at the university level could be developed within the Second Life virtual world. Results support the notion that it is possible to use this environment for better effectiveness in the learning of programming. The main results are the identification of problems hampering the teacher's intervention in this virtual world and the detection of solutions for those problems that were found effective to the success in using this environment for teaching/learning computer programming.",
    "author": "Esteves, Micaela and Fonseca, Benjamim and Morgado, Leonel and Martins, Paulo",
    "doi": "10.1111/j.1467-8535.2010.01056.x",
    "issn": "0007-1013",
    "journal": "British Journal of Educational Technology",
    "number": "4",
    "pages": "624--637",
    "publisher": "Wiley Online Library",
    "title": "{Improving teaching and learning of computer programming through the use of the Second Life virtual world - Esteves - 2010 - British Journal of Educational Technology - Wiley Online Library",
    "url": "http://onlinelibrary.wiley.com.berlioz.brandonu.ca/doi/10.1111/j.1467-8535.2010.01056.x/abstract",
    "volume": "42",
    "year": "2010"
  },
  "Casamayor2009{": {
    "EntryType": "article",
    "abstract": "Collaborative learning environments provide a set of tools for students acting in groups to interact and accomplish an assigned task. In this kind of systems, students are free to express and communicate with each other, which usually lead to collaboration and communication problems that may require the intervention of a teacher. In this article, we introduce an intelligent agent approach to assist teachers through monitoring participations made by students within a collaborative distance learning environment, detecting conflictive situations in which a teacher's intervention may be necessary. High precision rates achieved on conflict detection scenarios suggest great potential for the application of the proposed rule-based approach for providing personalized assistance to teachers during the development of group works. {\\textcopyright",
    "author": "Casamayor, Agustin and Amandi, Analia and Campo, Marcelo",
    "doi": "10.1016/j.compedu.2009.05.025",
    "issn": "03601315",
    "journal": "Computers and Education",
    "keywords": "Collaborative work,Distance learning,E-learning,Intelligent assistance,Software agents",
    "number": "4",
    "pages": "1147--1154",
    "publisher": "Elsevier",
    "title": "{Intelligent assistance for teachers in collaborative e-learning environments",
    "volume": "53",
    "year": "2009"
  },
  "Romero2008{": {
    "EntryType": "article",
    "abstract": "Educational data mining is an emerging discipline, concerned with developing methods for exploring the unique types of data that come from the educational context. This work is a survey of the specific application of data mining in learning management systems and a case study tutorial with the Moodle system. Our objective is to introduce it both theoretically and practically to all users interested in this new research area, and in particular to online instructors and e-learning administrators. We describe the full process for mining e-learning data step by step as well as how to apply the main data mining techniques used, such as statistics, visualization, classification, clustering and association rule mining of Moodle data. We have used free data mining tools so that any user can immediately begin to apply data mining without having to purchase a commercial tool or program a specific personalized tool. {\\textcopyright",
    "author": "Romero, Crist{\\'{o",
    "doi": "10.1016/j.compedu.2007.05.016",
    "isbn": "0029-6570",
    "issn": "03601315",
    "journal": "Computers and Education",
    "keywords": "Data mining,Distance education and telelearning,E-learning,Evaluation of CAL systems,Web mining",
    "number": "1",
    "pages": "368--384",
    "pmid": "1779839",
    "publisher": "Elsevier",
    "title": "{Data mining in course management systems: Moodle case study and tutorial",
    "volume": "51",
    "year": "2008"
  },
  "Galindo-Melero2014{": {
    "EntryType": "inproceedings",
    "author": "Galindo-Melero, J and Sanz-Angulo, P and De-Benito-Mart{\\'{i",
    "doi": "10.1109/CISTI.2014.6876982",
    "publisher": "IEEE Computer Society",
    "title": "{Need to establish a methodological philosophy of Competitive Intelligence in SMEs and research groups based on patent analysis [Necesidad de implantar una filosof{\\'{i",
    "url": "https://www.scopus.com/inward/record.uri?eid=2-s2.0-84906678533{\\&",
    "year": "2014"
  },
  "EscorsaCastells2017{": {
    "EntryType": "article",
    "author": "{Escorsa Castells",
    "publisher": "Revista Espacios",
    "title": "{Foresight analysis of the water sector for Panama to the year 2040 as a strategy for the identification of technological and innovation opportunities [An{\\'{a",
    "url": "https://www.scopus.com/inward/record.uri?eid=2-s2.0-85029579744{\\&",
    "year": "2017"
  },
  "LopezReguera2011{": {
    "EntryType": "article",
    "author": "{L{\\'{o",
    "doi": "10.4067/S0718-33052011000200011",
    "file": "::",
    "issn": "0718-3305",
    "journal": "Ingeniare. Revista chilena de ingenier{\\'{i",
    "month": "aug",
    "number": "2",
    "pages": "265--277",
    "publisher": "Universidad de Tarapac{\\'{a",
    "title": "{Una plataforma de evaluaci{\\'{o",
    "url": "http://www.scielo.cl/scielo.php?script=sci{\\_",
    "volume": "19",
    "year": "2011"
  }
}